## Задание 1

Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

## Решение

In [1]:
import pandas as pd

In [3]:
data = pd.read_csv('ratings.csv', sep=',')
data.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [4]:
data_movies = pd.read_csv('movies.csv', sep=',')
data_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
rating5 = data[data['rating'] == 5.0]
rating5.head()

    userId  movieId  rating   timestamp
0        1      296     5.0  1147880044
2        1      307     5.0  1147868828
3        1      665     5.0  1147878820
8        1     1237     5.0  1147868839
18       1     2632     5.0  1147878248

In [6]:
rating5['movieId'].value_counts().head(10)

318     39553
296     32169
356     25918
260     25804
2571    25482
527     24853
593     24801
858     24418
50      21585
2959    21486
Name: movieId, dtype: int64

Наибольшее количество оценок 5.0 имеет фильм с ID = 318

In [7]:
data_movies[data_movies['movieId'] == 318].head()

     movieId                             title       genres
314      318  Shawshank Redemption, The (1994)  Crime|Drama

Наибольшее количество оценок 5.0 имеет фильм "Побег из Шоушенка"

## Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

## Решение

In [8]:
data_power = pd.read_csv('power.csv', sep=',')
data_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [9]:
data_baltics = data_power[ (data_power['country']=='Latvia') | (data_power['country']=='Lithuania') | (data_power['country']=='Estonia') ]
data_baltics.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [10]:
data_baltics['country'].unique()

array(['Lithuania', 'Latvia', 'Estonia'], dtype=object)

In [11]:
data_baltics_cat = data_baltics[ (data_baltics['category']==4) | (data_baltics['category']==12) | (data_baltics['category']==21) ]
data_baltics_cat.head()

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
10621  Estonia  2004       1.0         4

In [12]:
data_baltics_cat['category'].unique()

array([ 4, 12, 21])

In [13]:
data_baltics_cat['quantity'].sum()

970605.0

## Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):

## Решение

In [14]:
## Не нашла другого сайта :(

In [15]:
df1 = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')[0]
df1.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,3 754,"0,9%",Nasdaq,14 685,"0,4%",Биткойн,32 631,"1,0%",USD/RUB,74,"0,0%"
1,РТС,1 600,"0,9%",S&P500,4 367,"0,2%",Нефть,735,"-0,2%",EUR/RUB,87,"0,1%"
2,Dow,"34 823,4","0,1%",FTSE100,"6 968,3000","-0,4%",Золото,1 803,"-0,2%",EUR/USD,11775,"0,0%"

In [16]:
df2 = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')[1]
df2.head()

,Unnamed: 0,Рубль,Предложение,Спрос,Предыдущее закрытие,%,Абсолютное значение,Время
0,NaN,GBP/RUB,1010879,-,1014262,"-0,33 %",-03384,13:49:00
1,NaN,EUR/RUB,865875,-,867235,"-0,16 %",-01360,13:49:00
2,NaN,USD/RUB,735800,-,736905,"-0,15 %",-01105,13:49:00
3,NaN,JPY/RUB,06661,-,06691,"-0,45 %",-00030,13:49:00
4,NaN,CNY/RUB,113592,-,113898,"-0,27 %",-00306,13:48:00

In [17]:
df3 = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')[2]
df3.head()

,0,1,2,3,4,5,6,7,8,9
0,Имя и фамилия,Город,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Телефон,Email,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,Спасибо! Ваша заявка отправлена Финансовый кон...,Спасибо! Ваша заявка отправлена Финансовый кон...,ошибка: не удалось создать заявку в журнале за...,ошибка: не удалось создать заявку в журнале за...,ошибка: не POST-запрос,ошибка: не POST-запрос,Просим Вас согласиться на передачу и обработку...,Просим Вас согласиться на передачу и обработку...
3,Я даю согласие на обработку своих персональных...,Я даю согласие на обработку своих персональных...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN